
## Plan Result




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sendgrid_api_key
  * azurerm_key_vault_secret.sendgrid_password_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.sendgrid_api_key will be created
  + resource "azurerm_key_vault_secret" "sendgrid_api_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat"
      + name                    = "send-grid-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sendgrid_password_key will be created
  + resource "azurerm_key_vault_secret" "sendgrid_password_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/adoption-aat/providers/Microsoft.KeyVault/vaults/adoption-aat"
      + name                    = "send-grid-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":804,"Program":"tfcmt","SHA1":"","Vars":{}} -->